[
  "dataview",
  "chord-lyrics",
  "external-links",
  "obsidian-excalidraw-plugin",
  "vim-yank-highlight",
  "obsidian-linter",
  "obsidian-kanban",
  "jira-linker",
  "obsidian-jira-issue",
  "iconic",
  "harpoon",
  "obsidian-git",
  "better-export-pdf",
  "remember-cursor-position",
  "copy-url-in-preview",
  "quick-explorer",
  "obsidian-vimrc-support"
]