[
  "dataview",
  "chord-lyrics",
  "obsidian-excalidraw-plugin",
  "vim-yank-highlight",
  "obsidian-linter",
  "obsidian-kanban",
  "jira-linker",
  "obsidian-jira-issue",
  "iconic",
  "harpoon",
  "obsidian-git",
  "better-export-pdf",
  "remember-cursor-position",
  "copy-url-in-preview",
  "quick-explorer",
  "obsidian-vimrc-support",
  "obsidian-relative-line-numbers",
  "more-vim",
  "table-editor-obsidian",
  "svelte-syntax-highlighter",
  "editing-toolbar",
  "floating-highlights",
  "obsidian-daily-stats",
  "vault-stats"
]